In [8]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,11,52,23,43,55],
                  'var2' :[10,111,222,333,444,555]},
                  columns=['groups' , 'var1'  , 'var2'])
df

  groups  var1  var2
0      A    10    10
1      B    11   111
2      C    52   222
3      A    23   333
4      B    43   444
5      C    55   555

In [9]:
def filter_func(x):
    return x["var1"].std() > 9

In [12]:
df.groupby("groups").std()

             var1        var2
groups
A        9.192388  228.395490
B       22.627417  235.466558
C        2.121320  235.466558

In [11]:
df.groupby("groups").filter(filter_func)

  groups  var1  var2
0      A    10    10
1      B    11   111
3      A    23   333
4      B    43   444

# Transform

In [14]:
import pandas as pd
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=['groups' , 'var1'  , 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   111
3      A    23   333
4      B    11   444
5      C    99   969

In [20]:
# tum gozlemleri sec:then   iloc: sutuna bagli      loc:satura bagli  categoric sutunu cikardim
df_numeric= df.iloc [:,1:3]

In [21]:
df_numeric.transform(lambda x: x-x.mean())

        var1        var2
0 -23.166667 -268.333333
1 -10.166667 -115.333333
2  -0.166667 -257.333333
3 -10.166667  -35.333333
4 -22.166667   75.666667
5  65.833333  600.666667

In [22]:
#transform fonksiyonu vectorel bazda calisiyor...sutun bazinda degiskenler uzerinde islem yapabiliyoruz

df_numeric.transform(lambda x:(x-x.mean())/x.std ())

       var1      var2
0 -0.694171 -0.832627
1 -0.304636 -0.357875
2 -0.004994 -0.798495
3 -0.304636 -0.109638
4 -0.664207  0.234791
5  1.972644  1.863844

## Apply

In [27]:
import pandas as pd
import numpy as np
df = pd.DataFrame({
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=[ 'var1'  , 'var2'])
df

   var1  var2
0    10   100
1    23   253
2    33   111
3    23   333
4    11   444
5    99   969

In [28]:
df.apply(np.sum)

var1     199
var2    2210
dtype: int64

In [29]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'groups':['A','B','C','A','B','C'],
                  'var1':[10,23,33,23,11,99],
                  'var2' :[100,253,111,333,444,969]},
                  columns=['groups' , 'var1'  , 'var2'])
df

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   111
3      A    23   333
4      B    11   444
5      C    99   969

In [30]:
df.apply(np.sum)

groups    ABCABC
var1         199
var2        2210
dtype: object

In [32]:
df.groupby("groups").apply(np.sum)

       groups  var1  var2
groups
A          AA    33   433
B          BB    34   697
C          CC   132  1080